org/gbasis/2023-g.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-25 水 20:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Masayuki Suzuki" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org8e74664">1. Groebner基底と固有値法</a></li>
</ul>
</div>
</div>
<div id="outline-container-org8e74664" class="outline-2">
<h2 id="org8e74664"><span class="section-number-2">1.</span> Groebner基底と固有値法</h2>
<div class="outline-text-2" id="text-1">
<p>
有理数(QQ) を係数とする多変数(\(x_1, x_2\)) の
多項式環 \(QQ[x_1, x_2]\) を生成し，
不定元$x<sub>1</sub>, x<sub>2</sub>$を取り出す:
</p>

<div class="org-src-container">
<pre class="src src-sage"><span style="color: #cae682;">x_1</span>, <span style="color: #cae682;">x_2</span> = QQ[<span style="color: #95e454;">'x_1,x_2'</span>].gens()
</pre>
</div>

<p>
$x<sub>1</sub>, x<sub>2</sub>, x<sub>3</sub>$を使って多項式を定義する:
</p>
<div class="org-src-container">
<pre class="src src-sage"><span style="color: #cae682;">f_1</span> = 2 * x_1^3 * x_2 +6*x_1^3 - 2* x_1^2 - x_1* x_2 - 3* x_1 - x_2 +3
<span style="color: #cae682;">f_2</span> = x_1^3*x_2 + 3*x_1^3 + x_1^2*x_2 + 2*x_1^2
<span style="color: #cae682;">f_3</span> = 3*x_1^2*x_2 + 9*x_1^2 + 2*x_1*x_2 + 5*x_1 + x_2 -3
f_1
f_2
f_3
</pre>
</div>

<pre class="example">
2*x_1^3*x_2 + 6*x_1^3 - 2*x_1^2 - x_1*x_2 - 3*x_1 - x_2 + 3
x_1^3*x_2 + 3*x_1^3 + x_1^2*x_2 + 2*x_1^2
3*x_1^2*x_2 + 9*x_1^2 + 2*x_1*x_2 + 5*x_1 + x_2 - 3
</pre>


<div class="org-src-container">
<pre class="src src-sage">f_1.lm()
f_2.lm()
</pre>
</div>

<pre class="example">
x_1^3*x_2
x_1^3*x_2
</pre>



<div class="org-src-container">
<pre class="src src-sage"><span style="color: #cae682;">f_4</span> = f_1 - 2*f_2
f_4
</pre>
</div>

<pre class="example">
-2*x_1^2*x_2 - 6*x_1^2 - x_1*x_2 - 3*x_1 - x_2 + 3
</pre>


<div class="org-src-container">
<pre class="src src-sage"><span style="color: #cae682;">f_5</span> = 2*f_3 + 3*f_4
f_5
</pre>
</div>

<pre class="example">
x_1*x_2 + x_1 - x_2 + 3
</pre>


<div class="org-src-container">
<pre class="src src-sage">f_1 % f_5
f_2 % f_5
f_3 % f_5
f_4 % f_5
</pre>
</div>


<pre class="example">
4*x_1^3 - 10*x_1^2 - 10*x_1
2*x_1^3 - 3*x_1^2 - 8*x_1 + 2*x_2 - 6
6*x_1^2 - 9*x_1 + 6*x_2 - 18
-4*x_1^2 + 6*x_1 - 4*x_2 + 12
</pre>



<div class="org-src-container">
<pre class="src src-sage"><span style="color: #cae682;">S</span> = [f_1, f_2, f_3, f_4, f_5]

f_4
</pre>
</div>



<p>
\(f_1\), \(f_2\), \(f_3\) を基底とするイデアル \(I\) を生成する:
</p>
<div class="org-src-container">
<pre class="src src-sage"><span style="color: #cae682;">I</span> = ideal(f_1, f_2, f_3, f_4, f_5)
I
</pre>
</div>

<pre class="example">
Ideal (2*x_1^3*x_2 + 6*x_1^3 - 2*x_1^2 - x_1*x_2 - 3*x_1 - x_2 + 3,
</pre>

<p>
x<sub>1</sub><sup>3</sup>*x<sub>2</sub> + 3*x<sub>1</sub><sup>3</sup> + x<sub>1</sub><sup>2</sup>*x<sub>2</sub> + 2*x<sub>1</sub><sup>2</sup>,
3*x<sub>1</sub><sup>2</sup>*x<sub>2</sub> + 9*x<sub>1</sub><sup>2</sup> + 2*x<sub>1</sub>*x<sub>2</sub> + 5*x<sub>1</sub> + x<sub>2</sub> - 3,
-2*x<sub>1</sub><sup>2</sup>*x<sub>2</sub> - 6*x<sub>1</sub><sup>2</sup> - x<sub>1</sub>*x<sub>2</sub> - 3*x<sub>1</sub> - x<sub>2</sub> + 3,
x<sub>1</sub>*x<sub>2</sub> + x<sub>1</sub> - x<sub>2</sub> + 3) of Multivariate Polynomial Ring in x<sub>1</sub>, x<sub>2</sub> over Rational Field
</p>

<p>
\(I\) のグレブナー基底を求める:
</p>

<div class="org-src-container">
<pre class="src src-sage"><span style="color: #cae682;">B</span> = I.groebner_basis(); B
</pre>
</div>

<pre class="example">
[x_1^2 - 3/2*x_1 + x_2 - 3, x_1*x_2 + x_1 - x_2 + 3, x_2^2 - 4*x_1 - 5/2*x_2 - 3/2]
</pre>


<p>
＜Groebner基底の行列表現＞
</p>

<p>
\[\begin{array}{c||cccccc|}
    &  x_1^2 & x_1 x_2 & x_2^2 & x_1 & x_2 & 1 \cr
    \hline\hline
    g_1 &  1 & 0 & 0 & 3/2 & -1 &  3 \cr
    g_2 & 0  & 1 & 0 &  -1 & 1  & 3\cr
    g_3 &  0 & 0 & 1 & 4   & 5/2 & 3/2 \cr
\end{array}\]
</p>

<ul class="org-ul">
<li>各基底 (\(g_i, i=1:3\))は，2次の頭項を持ち，2次の項は，1次の項の和に簡約される</li>

<li>剰余空間 $QQ[x<sub>1</sub>, x<sub>2</sub>]/I$の基底は，\(x_1, x_2, 1\) となることがわかる。</li>
</ul>


<div class="org-src-container">
<pre class="src src-sage"><span style="color: #e5786d;">type</span>(B)
</pre>
</div>

<p>
$QQ[x<sub>1</sub>, x<sub>2</sub>]/I$における，かけ算表を作成する:
</p>

<div class="org-src-container">
<pre class="src src-sage"><span style="color: #cae682;">bases</span> = [1,x_1,x_2]
<span style="color: #cae682;">x_1p</span> = [I.<span style="color: #e5786d;">reduce</span>(x_1*a) <span style="color: #8ac6f2; font-weight: bold;">for</span> a <span style="color: #8ac6f2; font-weight: bold;">in</span> bases]; x_1p
<span style="color: #cae682;">x_2p</span> = [I.<span style="color: #e5786d;">reduce</span>(x_2*a) <span style="color: #8ac6f2; font-weight: bold;">for</span> a <span style="color: #8ac6f2; font-weight: bold;">in</span> bases]; x_2p

</pre>
</div>

<pre class="example">
[x_1, 3/2*x_1 - x_2 + 3, -x_1 + x_2 - 3]
[x_2, -x_1 + x_2 - 3, 4*x_1 + 5/2*x_2 + 3/2]
</pre>


<div class="org-src-container">
<pre class="src src-sage"><span style="color: #cae682;">P1</span> = [ f.coefficient(b) <span style="color: #8ac6f2; font-weight: bold;">for</span> b <span style="color: #8ac6f2; font-weight: bold;">in</span> [{x_1:0, x_2:0}, {x_1:1, x_2:0}, {x_1:0, x_2:1}] <span style="color: #8ac6f2; font-weight: bold;">for</span> f <span style="color: #8ac6f2; font-weight: bold;">in</span> x_1p]; P1
<span style="color: #cae682;">P2</span> = [ f.coefficient(b) <span style="color: #8ac6f2; font-weight: bold;">for</span> b <span style="color: #8ac6f2; font-weight: bold;">in</span> [{x_1:0, x_2:0}, {x_1:1, x_2:0}, {x_1:0, x_2:1}] <span style="color: #8ac6f2; font-weight: bold;">for</span> f <span style="color: #8ac6f2; font-weight: bold;">in</span> x_2p]; P2
</pre>
</div>


<pre class="example">
[0, 3, -3, 1, 3/2, -1, 0, -1, 1]
[0, -3, 3/2, 0, -1, 4, 1, 1, 5/2]
</pre>


<div class="org-src-container">
<pre class="src src-sage"><span style="color: #cae682;">M1</span> = matrix(QQ,3,3,P1); M1
<span style="color: #cae682;">M2</span> = matrix(QQ,3,3,P2); M2

</pre>
</div>

<pre class="example">

[  0   3  -3]
[  1 3/2  -1]
[  0  -1   1]

[  0  -3 3/2]
[  0  -1   4]
[  1   1 5/2]
</pre>


<div class="org-src-container">
<pre class="src src-sage"><span style="color: #cae682;">s1</span> = M1.eigenvalues(); s1
<span style="color: #cae682;">s2</span> = M2.eigenvalues(); s2

</pre>
</div>

<pre class="example">
[0, -0.765564437074638?, 3.265564437074638?]
[3, -2.765564437074638?, 1.265564437074638?]
</pre>


<div class="org-src-container">
<pre class="src src-sage">[[i,j,yf_1.subs({x_1:s1[i], x_2:s2[j]}), f_2.subs({x_1:s1[i], x_2:s2[j]})] 
  <span style="color: #8ac6f2; font-weight: bold;">for</span> i <span style="color: #8ac6f2; font-weight: bold;">in</span> <span style="color: #e5786d;">range</span>(3) <span style="color: #8ac6f2; font-weight: bold;">for</span> j <span style="color: #8ac6f2; font-weight: bold;">in</span> <span style="color: #e5786d;">range</span>(3)]
</pre>
</div>

<pre class="example" id="org6ec54f6">

[[0, 0, 0, 0],
 [0, 1, 5.765564437074638?, 0],
 [0, 2, 1.734435562925363?, 0],
 [1, 0, -1.963057085015917?, 0.2383115901485682?],
 [1, 1, 4.562484917954546?, -0.5538774415303320?],
 [1, 2, 0.?e-17, 0.?e-17],
 [2, 0, 376.9630570850159?, 262.2616884098514?],
 [2, 1, 0.?e-15, 0.?e-16],
 [2, 2, 263.5625150820455?, 183.3663774415304?]]
</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Masayuki Suzuki</p>
<p class="date">Created: 2023-10-25 水 20:47</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>